using System;
using System.Collections.Generic;
using System.Text;
using ThiefWorld.Architecture;

namespace ThiefWorld.Interface
{
    public class Levels
    {
        public Level Level1 { get; private set; }
        public Level Level2 { get; private set; }
        public Level Level3 { get; private set; }
        public Level Level4 { get; private set; }
        public Level Level5 { get; private set; }
        
        public Levels()
        {
            Level1 = new Level(new Dictionary<string, string>
            {
                ["(308+873)+415"] = "1596",
                ["268 + 608 + 72"] = "948",
                ["98 - 67 + 85"] = "116",
                ["130 - 13 + 423"] = "540",
                ["256 - 34 - 213"] = "9",
                ["968 + 6 + 8 - 458"] = "524",
                ["56 - 438 + 7 + 394"] = "19",
                ["4 - 384 + 813 - (403 - 125)"] = "155",
            }, 
            new List<List<string>> 
            { 
                new List<string> { "1", "2", "3", "4", "5" }, 
                new List<string> { "11", "13", "12", "15", "14" }, 
                new List<string> { "29", "28", "27", "26", "25" },
                new List<string> { "32", "34", "36", "38", "40" },
                new List<string> { "51", "53", "55", "57", "59" },
                new List<string> { "13", "26", "39", "52", "65" },
                new List<string> { "1", "10", "100", "1000", "10000" },
                new List<string> { "78", "87", "89", "98" },
            },
            "Гуси шли на водопой гуськом(один за другим)." +
            "Один гусь посмотрел вперёд-перед ним 17 голов." +
            "Посмотрел назад-за ним 36 лап." +
            "Сколько всего гусей шло на водопой?",
            "36",
            1,
            new List<string> { "Initial" },
            null);

            Level2 = new Level(new Dictionary<string, string>
            {
                ["(308+873)+415"] = "1596",
                ["268 + 608 + 72"] = "948",
                ["98 - 67 + 85"] = "116",
                ["130 - 13 + 423"] = "540",
                ["256 - 34 - 213"] = "9",
                ["968 + 6 + 8 - 458"] = "524",
                ["56 - 438 + 7 + 394"] = "19",
                ["4 - 384 + 813 - (403 - 125)"] = "155",
            }, 
            new List<List<string>> 
            { 
                new List<string> { "1", "2", "3", "4", "5" }, 
                new List<string> { "11", "13", "12", "15", "14" }, 
                new List<string> { "29", "28", "27", "26", "25" },
                new List<string> { "32", "34", "36", "38", "40" },
                new List<string> { "51", "53", "55", "57", "59" },
                new List<string> { "13", "26", "39", "52", "65" },
                new List<string> { "1", "10", "100", "1000", "10000" },
                new List<string> { "78", "87", "89", "98" },
            },
            "Гуси шли на водопой гуськом(один за другим)." +
            "Один гусь посмотрел вперёд-перед ним 17 голов." +
            "Посмотрел назад-за ним 36 лап." +
            "Сколько всего гусей шло на водопой?",
            "36",
            1,
            new List<string> { "Initial" },
            Level1);

            Level3 = new Level(new Dictionary<string, string>
            {
                ["(308+873)+415"] = "1596",
                ["268 + 608 + 72"] = "948",
                ["98 - 67 + 85"] = "116",
                ["130 - 13 + 423"] = "540",
                ["256 - 34 - 213"] = "9",
                ["968 + 6 + 8 - 458"] = "524",
                ["56 - 438 + 7 + 394"] = "19",
                ["4 - 384 + 813 - (403 - 125)"] = "155",
            },
            new List<List<string>>
            {
                new List<string> { "1", "2", "3", "4", "5" },
                new List<string> { "11", "13", "12", "15", "14" },
                new List<string> { "29", "28", "27", "26", "25" },
                new List<string> { "32", "34", "36", "38", "40" },
                new List<string> { "51", "53", "55", "57", "59" },
                new List<string> { "13", "26", "39", "52", "65" },
                new List<string> { "1", "10", "100", "1000", "10000" },
                new List<string> { "78", "87", "89", "98" },
            },
            "Гуси шли на водопой гуськом(один за другим)." +
            "Один гусь посмотрел вперёд-перед ним 17 голов." +
            "Посмотрел назад-за ним 36 лап." +
            "Сколько всего гусей шло на водопой?",
            "36",
            1,
            new List<string> { "Initial" },
            Level2);

            Level4 = new Level(new Dictionary<string, string>
            {
                ["(308+873)+415"] = "1596",
                ["268 + 608 + 72"] = "948",
                ["98 - 67 + 85"] = "116",
                ["130 - 13 + 423"] = "540",
                ["256 - 34 - 213"] = "9",
                ["968 + 6 + 8 - 458"] = "524",
                ["56 - 438 + 7 + 394"] = "19",
                ["4 - 384 + 813 - (403 - 125)"] = "155",
            },
            new List<List<string>>
            {
                new List<string> { "1", "2", "3", "4", "5" },
                new List<string> { "11", "13", "12", "15", "14" },
                new List<string> { "29", "28", "27", "26", "25" },
                new List<string> { "32", "34", "36", "38", "40" },
                new List<string> { "51", "53", "55", "57", "59" },
                new List<string> { "13", "26", "39", "52", "65" },
                new List<string> { "1", "10", "100", "1000", "10000" },
                new List<string> { "78", "87", "89", "98" },
            },
            "Гуси шли на водопой гуськом(один за другим)." +
            "Один гусь посмотрел вперёд-перед ним 17 голов." +
            "Посмотрел назад-за ним 36 лап." +
            "Сколько всего гусей шло на водопой?",
            "36",
            1,
            new List<string> { "Initial" },
            Level3);

            Level5 = new Level(new Dictionary<string, string>
            {
                ["(308+873)+415"] = "1596",
                ["268 + 608 + 72"] = "948",
                ["98 - 67 + 85"] = "116",
                ["130 - 13 + 423"] = "540",
                ["256 - 34 - 213"] = "9",
                ["968 + 6 + 8 - 458"] = "524",
                ["56 - 438 + 7 + 394"] = "19",
                ["4 - 384 + 813 - (403 - 125)"] = "155",
            },
            new List<List<string>>
            {
                new List<string> { "1", "2", "3", "4", "5" },
                new List<string> { "11", "13", "12", "15", "14" },
                new List<string> { "29", "28", "27", "26", "25" },
                new List<string> { "32", "34", "36", "38", "40" },
                new List<string> { "51", "53", "55", "57", "59" },
                new List<string> { "13", "26", "39", "52", "65" },
                new List<string> { "1", "10", "100", "1000", "10000" },
                new List<string> { "78", "87", "89", "98" },
            },
            "Гуси шли на водопой гуськом(один за другим)." +
            "Один гусь посмотрел вперёд-перед ним 17 голов." +
            "Посмотрел назад-за ним 36 лап." +
            "Сколько всего гусей шло на водопой?",
            "36",
            1,
            new List<string> { "Initial" },
            Level4);
        }

    }
}
